[
  {
    "url": "https://deadline.com",
    "headlines": [
      "deadline-logo-svg\nDeadline",
      "Follow Us:",
      "site categories",
      "Deadline",
      "BREAKING NEWS",
      "TONY AWARDS Nominations Snubs (‘Othello’) & Surprises; Hollywood’s Big Day; Reactions",
      "FILM Penélope Cruz & Javier Bardem To Star In Florian Zeller Thriller ‘Bunker’",
      "REVIEWS Pete Hammond’s Verdict On ‘Rust’, Alec Baldwin’s Tragedy-Hit Indie Western",
      "BOX OFFICE ‘Final Reckoning’ & ‘Lilo’ Eye $200M Combined: Record Memorial Day Frame?",
      "TV Disney Studios Chief On Big Fox Animation Deal, ‘Buffy’ & Other Reboots, Strategy & Filming In L.A.",
      "Latest News",
      "‘RuPaul’s Drag Race All Stars’ Season 10 Guest Judges List: Cynthia Erivo, Ariana Grande, Chappell Roan & More",
      "Carrie Coon’s Bertha Russell Wants “Real Opportunity” Of Marriage For Her Children In ‘The Gilded Age’ Season 3 Teaser Trailer; Premiere Date Set",
      "‘Resident Alien’ To Stay On Syfy After All In Simulcast With USA; Season 4 Premiere Date & Trailer Released",
      "Critics Choice Real TV Noms: ‘The Traitors’ Leads Field Over ‘DWTS’ & ‘Top Chef’ – Full List",
      "Trending on Deadline",
      "1 'The Young & The Restless' Says Farewell To Allison Lanier…",
      "2 Robert De Niro Shows \"Love & Support\" For Daughter Airyn…",
      "3 Disney TV Studios Chief Eric Schrier On Big Fox Animation…",
      "4 Tony Awards Nominations Snubs And Surprises: 'Othello'…",
      "5 News & Documentary Emmy Nominations Revealed",
      "6 NBCUniversal Execs Face Reality Check As Unscripted Hit…",
      "7 Lester Holt's Final Day As 'NBC Nightly News' Anchor Set…",
      "8 Four Fanboy Flicks Bomb Out In Deadline's 2024 Most…",
      "9 Lionsgate's 50 Cent Action Becomes No. 1 Action Channel On…",
      "10 Matthew Lillard In Talks To Join 'Carrie' Amazon Series",
      "Saban Films Takes North America On Western ‘The Unholy Trinity’ Starring Pierce Brosnan & Samuel L. Jackson, Will Release With Roadside Attractions",
      "Peabody Award Winners Include ‘Baby Reindeer’, ‘Ripley’, ‘Fantasmas’ & ‘Will & Harper’",
      "Matthew Lillard In Talks To Join ‘Carrie’ Amazon Series",
      "What We're Watching",
      "The Actor’s Side: Adam Brody On ‘Nobody Wants This’ & More",
      "‘The Smashing Machine’ Trailer Sends Dwayne Johnson Into Ring",
      "‘Dexter: Resurrection’ Teaser Trailer + Premiere Date",
      "‘Weapons’ Trailer: Zach Cregger’s Buzzy Warner Bros Horror Film",
      "‘America’s Got Talent’ Season 20 Trailer Brings Back Season 1 Contestant & Gives First Look At Mel B’s Return As Judge",
      "‘BMF’ Drops First Trailer For Season 4 As Michael Chiklis Joins Cast",
      "Melissa Joan Hart Signs With Innovative Artists Entertainment",
      "Cannes Film Festival 2025 Lineup",
      "16 Titles Added To Official Selection Including Lawrence, Stewart, Pattinson Pics",
      "Cannes Lineup List: Competition, Un Certain Regard, Special Screenings, More",
      "5 Lineup Takeaways: A Distinctly Fresh Vibe But Also Plenty Of Star Power",
      "From Tom Cruise To Emma Stone: Which Stars Are Likely To Walk This Year’s Red Carpet?",
      "Shudder Ups Sam Zimmerman To SVP Programming And Acquisitions",
      "Disney TV Studios Chief Eric Schrier On Big Fox Animation Deal, Global Originals Strategy, ‘Buffy’ & Other Reboots, Backend Model & Filming In L.A.",
      "Well, that's why they're called SOAP operas!",
      "From The Magazine",
      "Contenders Television: Docs, Unscripted & Variety",
      "Lineup and preview of Deadline's April 26 virtual showcase",
      "Contenders Television",
      "Lineup, schedule and preview for April 5-6 showcase",
      "Contenders Film: The Nominees",
      "Preview and panel lineup for Deadline's February 8 awards-season event",
      "Contenders Film: Documentary",
      "Preview and panel lineup for Deadline's December 8 awards-season event",
      "Contenders Film: International",
      "Preview and panel lineup for Deadline's December 7 awards-season event",
      "AwardsLine: Oscar Preview",
      "Ridley Scott & His 'Gladiator II' Stars On How All Roads Led Back To Ancient Rome",
      "Contenders Film: Los Angeles",
      "Lineup, schedule and preview for November 16 showcase",
      "Sound & Screen: Film",
      "Lineup and preview of November 1 awards-season musical event",
      "Marketplace",
      "Latest by Category",
      "Saban Films Takes North America On Western ‘The Unholy Trinity’ Starring Pierce Brosnan & Samuel L. Jackson, Will Release With Roadside Attractions",
      "Oscilloscope Labs Elevates Aaron Katz To SVP Acquisitions & Development, Alexandra Fredricks As VP Theatrical Sales",
      "Shudder Acquires Supernatural Thriller ‘Good Boy’ From Director Ben Leonberg After SXSW Premiere",
      "‘Resident Alien’ To Stay On Syfy After All In Simulcast With USA; Season 4 Premiere Date & Trailer Released",
      "Critics Choice Real TV Noms: ‘The Traitors’ Leads Field Over ‘DWTS’ & ‘Top Chef’ – Full List",
      "Peabody Award Winners Include ‘Baby Reindeer’, ‘Ripley’, ‘Fantasmas’ & ‘Will & Harper’",
      "‘Lilo & Stitch’ & ‘Mission: Impossible – Final Reckoning’ Combined Will Gross $200M+ In What Could Be Biggest Memorial Day Weekend Ever At Box Office",
      "Michael Angelo Covino’s Cannes Premiere ‘Splitsville’ Gets Summer U.S. Release Date From Neon",
      "Oscilloscope Labs Elevates Aaron Katz To SVP Acquisitions & Development, Alexandra Fredricks As VP Theatrical Sales",
      "Shudder Ups Sam Zimmerman To SVP Programming And Acquisitions",
      "Joe Biden To Appear On ‘The View’ In First Interview Since Leaving Office; Former POTUS Will Be Joined By Jill Biden",
      "Mike Waltz Expected To Exit As Donald Trump’s National Security Adviser",
      "Featured Voices",
      "Nellie Andreeva",
      "Co-Editor-in-Chief, TV",
      "Pete Hammond",
      "Awards Columnist/Chief Film Critic",
      "Peter Bart",
      "Editor-At-Large",
      "Baz Bamigboye",
      "Columnist/International Editor At Large",
      "Newswire",
      "Deadline",
      "Sitemap",
      "Connect with Us",
      "Have a Tip?",
      "Stay in the Know",
      "Our Sites"
    ]
  },
  {
    "url": "https://variety.com",
    "headlines": [
      "Variety",
      "'The Last of Us'",
      "'Thunderbolts'",
      "Media Stocks",
      "Tony Nominations",
      "‘Sinners’ Sets Imax 70mm Re-Release for May",
      "Tony Nominations Snubs and Surprises: Denzel Washington, Jake Gyllenhaal, Kieran Culkin, Idina Menzel Overlooked in Starry Season",
      "‘A Different Man’ Star Adam Pearson to Play Joseph Merrick in ‘The Elephant Man’ Film Adaptation (EXCLUSIVE)",
      "Willem Dafoe to Star in Dark Comedy ‘The Souffleur’ From Rising Helmer Gastón Solnicki (EXCLUSIVE)",
      "‘The Four Seasons’ Review",
      "Most Popular",
      "Tony Nominations 2025: ‘Death Becomes Her,’ ‘Maybe Happy Ending’ and ‘Buena Vista Social Club’ Lead",
      "Robert De Niro Shares ‘Love and Support’ for His Daughter Airyn After She Comes Out as Transgender: ‘I Don’t Know What the Big Deal Is…",
      "‘The Masked Singer’ Reveals Identity of Lucky Duck: Here Is the Celebrity Under the Costume",
      "Bill Belichick Says CBS Interview Presented ‘False Narrative’ That His Girlfriend Jordon Hudson ‘Was Attempting to Control the Conversation…",
      "Kit Harington Recalls the ‘Humiliating’ Experience of Bella Ramsey Telling Him His Lines on ‘Game of Thrones’: ‘That Child Actor Is Wiping Me Off the…",
      "'Rocky Horror Picture Show' Gets 4K Remaster and New Logo for 50th Anniversary (EXCLUSIVE)",
      "Sheryl Crow on Settling Down but Still Fighting the Power in Nashville: ‘I Call My Representatives Every Single Morning’",
      "‘Rust’ Director Says He Didn’t Watch Alec Baldwin’s Reality Show: ‘I Think I Was Busy Hitting Myself in the Face With a Frying Pan That Night…",
      "‘A Different Man’ Star Adam Pearson to Play Joseph Merrick in ‘The Elephant Man’ Film Adaptation (EXCLUSIVE)",
      "Tina Fey’s ‘The Four Seasons’ Takes a Step Outside the Comedy Icon’s Comfort Zone, but Doesn’t Thrive There: TV Review",
      "Recommended For You",
      "Pedro Cabeleira’s ‘Night Passengers’ Boarded by Pluto Film Ahead of Cannes Premiere (EXCLUSIVE)",
      "What an AI War on Copyright Law Could Mean for Content Creators",
      "The ‘M3GAN’ ‘Second Screen’ Chatbot Is an Epic Fail — and Offers Another Dire Warning for Our Future",
      "Comedy Dynamics Announces New Specials From Jay Jurden, Bob the Drag Queen, Chris Porter and Jiaoying Summers (EXCLUSIVE)",
      "What Warner Bros. Can Learn From Netflix About Video Game Strategy",
      "New NYT Games Feature Will Let Fans Play Wordle Against Celebs Laufey, Lola Tung, Chris Perfetti, Luann de Lesseps and Sonja Morgan (EXCLUSIVE)",
      "Sign Up for Variety Newsletters",
      "Latest News",
      "‘Gilded Age’ Sets Season 3 Release Date, HBO Drops First Teaser",
      "VidCon’s Inaugural Hall of Fame Inductees Include Rhett & Link, Hank Green, Smosh Founders, Grace Helbig and More",
      "State of the Video Game Industry: A Special Report",
      "Goop’s Mother’s Day Gift Guide Is Here: A Home Sauna, $17,000 Necklace and Lots of Cookware",
      "The ‘M3GAN’ ‘Second Screen’ Chatbot Is an Epic Fail — and Offers Another Dire Warning for Our Future",
      "Microdrama Plot Twist: A Threat to the Apps’ Stratospheric U.S. Growth",
      "Cole Escola, Lisa Rinna, Paul Feig and More Revealed as ‘King of Drag’ Guest Judges in First Trailer (EXCLUSIVE)",
      "‘Outlander’ Actor Graham McTavish to Star in Neil Marshall’s Survival Thriller ‘Gunn’ (EXCLUSIVE)",
      "Gwyneth Paltrow Calls Ski Trial ‘Everything That’s Wrong With Our Legal System,’ Was Determined Not to Be ‘Shaken Down’",
      "‘Ghosts’ Scene Stealer Betsy Sodaro on Nancy’s Unique Backstory and the Role She Originally Auditioned For",
      "Actors on Actors: Broadway",
      "George Clooney and Patti LuPone Get Honest About Broadway Pay",
      "Jake Gyllenhaal and Audra McDonald on Playing Broadway Villains",
      "‘Succession’ Siblings Reunite: Kieran Culkin and Sarah Snook on Forgetting Lines, Acting in Bad Projects and Why Broadway Is ‘So F—ing Athletic…",
      "Nicole Scherzinger and Jonathan Groff Bond Over NSFW Banter, Performing Sick on Broadway and ‘Patti F—ing LuPone’",
      "Cole Escola and Darren Criss Embrace Chaos and Crying on Broadway",
      "Strictly Business",
      "Sign up for Variety Breaking News Alerts",
      "Reviews",
      "‘Thunderbolts*’",
      "‘Sinners’",
      "‘Rust’",
      "‘Another Simple Favor’",
      "‘Interior Chinatown’",
      "‘Dune: Prophecy’",
      "‘Landman’",
      "'The Day of the Jackal’",
      "‘Hit Me Hard and Soft’",
      "‘Atavista’",
      "‘Dark Times’",
      "‘Radical Optimism’",
      "‘An Enemy of the People’",
      "‘Long Day’s Journey Into Night’",
      "‘Tommy’",
      "‘Water for Elephants’",
      "Jodie Foster & Robert Downey Jr. — Actors on Actors (Full Conversation)",
      "Featured Video",
      "Jodie Foster & Robert Downey Jr. — Actors on Actors (Full Conversation)",
      "Netflix Buys Glen Powell, Anthony Mackie and Laura Dern Legal Drama ‘Monsanto’",
      "Special Report: State of the Video Game Industry",
      "Microdrama Plot Twist: A Threat to the Apps' Massive U.S. Growth",
      "Horror Overkill: Too Many Scary Movies Set for Theatrical Release",
      "How the 'Sinners' Financing Model Offers Salvation for All Producers",
      "What an AI War on Copyright Law Could Mean for Content Creators",
      "What To Buy",
      "How to Watch the 2025 NHL Playoffs Online",
      "2025 Music Festivals: Where to Find Affordable Tickets Online",
      "Get Festival Ready With These 15 Fashion Essentials",
      "Lady Gaga’s ‘Mayhem Ball’: Where to Find Tickets Online",
      "Awards",
      "Ryan Coogler's 'Sinners' Is the First Oscar Movie of 2025",
      "Why Noah Wyle and ‘The Pitt’ Will Bring Procedural Dramas Back to the Emmy Race",
      "Academy Sets New Oscars Rules for 2025: You Need to Watch All Nominated Films to Vote in a Category",
      "A Standing Ovation for Oscars Adding Stunts and Casting Awards, A Win for Unsung Movie Heroes",
      "How 77-Year-Old Kathy Bates Could Break an Emmy Record With ‘Matlock’ Role",
      "Cole Escola, Lisa Rinna, Paul Feig and More Revealed as ‘King of Drag’ Guest Judges in First Trailer (EXCLUSIVE)",
      "Comedy Dynamics Announces New Specials From Jay Jurden, Bob the Drag Queen, Chris Porter and Jiaoying Summers (EXCLUSIVE)",
      "‘Ghosts’ Scene Stealer Betsy Sodaro on Nancy’s Unique Backstory and the Role She Originally Auditioned For",
      "‘Baby Reindeer,’ ‘Ripley,’ ‘Shogun,’ ‘We Are Lady Parts’ Among This Year’s Peabody Award Winners",
      "‘Monopoly Go!’ Launches Star Wars Crossover Collaboration, Spanning ‘The Mandalorian’ and ‘The Skywalker Saga’",
      "The ‘M3GAN’ ‘Second Screen’ Chatbot Is an Epic Fail — and Offers Another Dire Warning for Our Future",
      "‘Outlander’ Actor Graham McTavish to Star in Neil Marshall’s Survival Thriller ‘Gunn’ (EXCLUSIVE)",
      "Gwyneth Paltrow Calls Ski Trial ‘Everything That's Wrong With Our Legal System,’ Was Determined Not to Be ‘Shaken Down’",
      "‘Monopoly Go!’ Launches Star Wars Crossover Collaboration, Spanning ‘The Mandalorian’ and ‘The Skywalker Saga’",
      "‘Sinners’ Sets Imax 70mm Re-Release for May",
      "Ed Sheeran Announces New Album ‘Play,’ Releases Single ‘Old Phone’",
      "Green Day's Billie Joe Armstrong on the 'American Idiot' Film That Never Panned Out and What Led Him to Punk: 'It Just Seemed Like It Was Music for…",
      "Nashville Strong: the City’s Top Female-Forward and Songwriter Charities and Support Organizations",
      "Big Loud Sells Minority Stake in Morgan Wallen's Catalog for $200 Million",
      "Jon M. Chu, Bong Joon Ho, Charli xcx and More Honored on Gold House's 2025 A100 List",
      "Theater",
      "Tony Nominations Snubs and Surprises: Denzel Washington, Jake Gyllenhaal, Kieran Culkin, Idina Menzel Overlooked in Starry Season",
      "Denzel Washington and Jake Gyllenhaal’s ‘Othello’ Shatters Broadway Box Office Records, Recoups Investment but Gets Snubbed by Tony…",
      "Tony Nominations 2025: ‘Death Becomes Her,’ ‘Maybe Happy Ending’ and ‘Buena Vista Social Club’ Lead",
      "‘Rolling Thunder’ Making U.S. Premiere at New World Stages (EXCLUSIVE)",
      "David Hyde Pierce on Returning to Broadway in ‘Pirates! The Penzance Musical’ and Turning Down the ‘Frasier’ Reboot",
      "Artisans",
      "AI Startup Morphic to Produce Anime Series ‘DQN,’ Launches $1 Million Creator Fund for Emerging Filmmakers (EXCLUSIVE)",
      "Trent Reznor, Jeff Toyne Take Top Honors at ASCAP Screen Music Awards",
      "Proof of Concept Filmmakers Debut at L.A. Showcase: 'These Helmers Can Start Shaping and Remaking the Industry,’ Says Cate Blanchett",
      "Former Cinematographers Guild Head John Lindley Elected to Return as Local 600’s President",
      "Natasha Lyonne to Direct Feature ‘Uncanny Valley’ Combining ‘Ethical’ AI and Traditional Filmmaking Techniques",
      "VidCon’s Inaugural Hall of Fame Inductees Include Rhett & Link, Hank Green, Smosh Founders, Grace Helbig and More",
      "‘Monopoly Go!’ Launches Star Wars Crossover Collaboration, Spanning ‘The Mandalorian’ and ‘The Skywalker Saga’",
      "'Nonsense Christmas With Sabrina Carpenter' Producer OBB Media Expands Production and Branded Content Operations to New York City",
      "How to Make Money With Content: An Explainer With Ben Silverman",
      "Xbox Hikes Consoles Prices More Than 25% Amid Trump Tariffs",
      "Exposure",
      "Jon M. Chu, Bong Joon Ho, Charli xcx and More Honored on Gold House's 2025 A100 List",
      "George Takei to Receive the National Equal Justice Award at Legal Defense Fund Dinner",
      "Steven Spielberg Calls ‘The Godfather’ the ‘Greatest American Film Ever Made’ at Francis Ford Coppola AFI Life Achievement Award…",
      "LaTanya Richardson Jackson, LaChanze and Khaila Wilcoxon Named Black Women on Broadway Awards Honorees (EXCLUSIVE)",
      "Noah Schnapp Reflects on Coming Out Before ‘Stranger Things’ Season 5 Filming: ‘I’m Finally Living Truthfully’",
      "Politics",
      "Trump Falsely Claims '60 Minutes' Admitted to ‘Crime’ of Editing Harris Interview in a Way That ‘Cheated and Defrauded the American People…",
      "Sony Film Chief Tom Rothman and Two Others Sue White House Over Firing From Corporation for Public Broadcasting Board",
      "By Bowing to Trump, White House Correspondents’ Dinner Fell Short at a Critical Time",
      "George Santos, Ex-Congressman, Sentenced to 87 Months in Prison on Fraud Charges",
      "Trump Lashes Out at Rupert Murdoch Over Fox News’ ‘Trump Hating, Fake Pollster’ After Survey Reveals Record-Low Approval Ratings",
      "The Magazine",
      "Sheryl Crow on Settling Down but Still Fighting the Power in Nashville: ‘I Call My Representatives Every Single Morning’",
      "George Clooney and Patti LuPone Get Honest About Broadway Pay, Surviving the Trump Era and Elon Musk: ‘Isn’t He Destroying the Government?’",
      "Noah Wyle Was Nearing a ‘Nervous Breakdown.’ Then Came ‘The Pitt’: It’s ‘Infuriating We Can’t Come to a Consensus’ on Masks and Vaccines",
      "How Charlamagne Tha God Built His Empire and Is Using His Platform to Lift Up Black Artists: ‘If What You Build Only Benefits You, It’s Not Big Enough’",
      "More From Our Brands",
      "Trump Goes Full Grinch as Tariffs Threaten to Ruin Christmas",
      "BMW Is Making a New All-Electric Station Wagon",
      "Sports Cards Lead eBay Growth as Goldin, PSA Drive Volume",
      "Kohl’s Fires CEO Ashley Buchanan Citing Conflict of Interest",
      "Resident Alien Season 4: The Mantid Turns Patience Upside Down in New Trailer — Plus, Get Premiere Date",
      "Follow Us",
      "We Care About Your Privacy",
      "We and our partners process data to provide:",
      "Manage Consent Preferences",
      "Cookie List"
    ]
  },
  {
    "url": "https://www.thewrap.com",
    "headlines": [
      "Trending Topics:",
      "Top Stories",
      "Can Netflix Reach the $1 Trillion Club by 2030?",
      "100 Days of Trump: MSNBC and CNN Ratings Trudge to Pre-Election Numbers as Fox News Grows",
      "2025 Tony Nominations: ‘Buena Vista Social Club,’ ‘Death Becomes Her’ and ‘Maybe Happy Ending’ Lead With 10 Nods Each",
      "Steve Doocy to Scale Back Role at ‘Fox & Friends,’ Move to Florida | Video",
      "Latest News",
      "‘The Handmaid’s Tale’ Cast Answers Who June Loves More: Luke or Nick",
      "Jen Psaki Calls Trump an ‘Aspiring King’ Who Thinks He Isn’t Subject to Consequences | Video",
      "Roku CEO Anthony Wood’s 2024 Pay Rises 37% to $27.7 Million",
      "A24’s ‘Sorry, Baby’ Trailer Gives First Look at Gripping Sundance Favorite",
      "‘Baby Reindeer,’ ‘Shōgun,’ ‘Will and Harper’ Among 2025 Peabody Award Winners",
      "TheWrapBook",
      "Faces of 2024",
      "Artists by Artists",
      "In Focus",
      "Visionaries",
      "Isabella Rossellini and Mikey Madison Talk ‘Conclave,’ ‘Anora’ and Finding the Power in Their Complicated Roles | Visionaries",
      "‘Wicked’: Cynthia Erivo and Jon M. Chu on Crafting Elphaba, the ‘Heartbreaking’ Party Scene and Subverting Expectations | Visionaries",
      "Marianne Jean-Baptiste and Aunjanue Ellis-Taylor Talk ‘Hard Truths,’ ‘Nickel Boys’ and Bold Creative Swings | Visionaries",
      "Awards",
      "‘Baby Reindeer,’ ‘Shōgun,’ ‘Will and Harper’ Among 2025 Peabody Award Winners",
      "Embattled ‘60 Minutes’ Kamala Harris Interview Among Nominees for 2025 News and Doc Emmys",
      "7 Surprising Snubs From the 2025 Tony Nominations",
      "WrapPRO",
      "‘Thunderbolts’ Probably Won’t Be a Huge Hit, but Could Get Marvel Back on Track",
      "Ad-Supported Platforms Account for 72.4% of TV Viewing in First Quarter of 2025",
      "100 Days of Trump: MSNBC and CNN Ratings Trudge to Pre-Election Numbers as Fox News Grows",
      "Can Netflix Reach the $1 Trillion Club by 2030?",
      "Power Women Summit",
      "Stacey Abrams Says Democrats’ Responsibility Is ‘Not to Wallow’ Through Trump’s 2nd Term | Video",
      "Power Women Summit 2024 Portrait Studio: The Fanning Sisters, Laura Dern, Jordan Chiles and More | Photos",
      "‘Social Studies’ Team Says Banning Teens’ Phones in School Would Let Them ‘Find Other Ways to Socialize’ | Video",
      "WrapStyle",
      "Nicole Kidman to Receive Kering’s Women in Motion Award at Cannes",
      "The Skirball Debuts ‘Jack Kirby: Heroes and Humanity’ and ‘Away in the Catskills’ Exhibits",
      "The Fashion Trust US Hosts Its 3rd Annual Awards With Keke Palmer",
      "Latest News",
      "Polygon Hit With Layoffs as Vox Sells Gaming Site to Valnet",
      "Ryan Coogler’s ‘Sinners’ Returns to Imax 70mm Screens Later This Month",
      "Stephen Colbert Takes a Swig of Jack Daniel’s While Dishing on Recession Indicators | Video",
      "‘The View’: Whoopi Thinks Trump Is Tanking Economy Because He’s ‘Getting Even’ With Those Who Didn’t Support Him",
      "‘Thunderbolts’ Probably Won’t Be a Huge Hit, but Could Get Marvel Back on Track",
      "Holding On in Hollywood",
      "A Hollywood Hairdresser Styled ‘Star Wars’ Actors Before the Slowdown Led Her to Open the ‘Shack in the Back’",
      "A Dolly Grip Says: ‘I Don’t Know How Long This Career Can Sustain Itself’",
      "A Sitcom Writer-Turned-Psychologist Counsels Hollywood Workers on the ‘Industry Apocalypse’",
      "An Assistant Director Says: ‘There Are 100s of Us Sitting at Home’ as Production Shrinks",
      "Columns",
      "Sharon Waxman",
      "Steve Pond",
      "Rachel Marlowe",
      "Brian Lowry",
      "Power Women Summit",
      "Power Women Summit 2024 Portrait Studio: The Fanning Sisters, Laura Dern, Jordan Chiles and More | Photos",
      "‘Social Studies’ Team Says Banning Teens’ Phones in School Would Let Them ‘Find Other Ways to Socialize’ | Video",
      "Producer Nicole Jefferson Asher Says Studios Had to Be ‘Forced’ to Consider Reproductive Rights for TV Crew | Video",
      "Veteran Music Exec Says Recording Studios Aren’t Safe Spaces for Women: ‘There’s Really No Rules’ | Video",
      "‘The Handmaid’s Tale’ Cast Answers Who June Loves More: Luke or Nick",
      "Jen Psaki Calls Trump an ‘Aspiring King’ Who Thinks He Isn’t Subject to Consequences | Video",
      "Roku CEO Anthony Wood’s 2024 Pay Rises 37% to $27.7 Million",
      "‘Baby Reindeer,’ ‘Shōgun,’ ‘Will and Harper’ Among 2025 Peabody Award Winners",
      "Movies",
      "A24’s ‘Sorry, Baby’ Trailer Gives First Look at Gripping Sundance Favorite",
      "Ryan Coogler’s ‘Sinners’ Returns to Imax 70mm Screens Later This Month",
      "‘Thunderbolts’ Probably Won’t Be a Huge Hit, but Could Get Marvel Back on Track",
      "Florence Pugh’s Granny Was Allowed to Call ‘Action’ on ‘Thunderbolts*’ – But Kept Doing It When No One Was Ready | Video",
      "Pivot to Video: The Big Business Behind the Rise of Podcasts You Can Watch",
      "Polygon Hit With Layoffs as Vox Sells Gaming Site to Valnet",
      "‘Maddow’ Producer Andrew Dallos Leaves Show After 17 Years",
      "Mark Zuckerberg: If You Need a Therapist, Try Meta’s AI Bot",
      "Awards",
      "‘Baby Reindeer,’ ‘Shōgun,’ ‘Will and Harper’ Among 2025 Peabody Award Winners",
      "Embattled ‘60 Minutes’ Kamala Harris Interview Among Nominees for 2025 News and Doc Emmys",
      "7 Surprising Snubs From the 2025 Tony Nominations",
      "2025 Tony Nominations: ‘Buena Vista Social Club,’ ‘Death Becomes Her’ and ‘Maybe Happy Ending’ Lead With 10 Nods Each",
      "Reviews",
      "‘The Four Seasons’ Review: Tina Fey Turns Midlife Crises Into Breezy TV With Netflix Remake",
      "‘Rust’ Review: The Specter of a Real-Life Death Haunts This Tragic Western",
      "‘Thunderbolts*’ Review: Marvel’s B-Team Gets an A for Effort",
      "‘Real Women Have Curves’ Broadway Review: Latinas Take Cover to Break Free",
      "Politics",
      "‘The View’: Whoopi Thinks Trump Is Tanking Economy Because He’s ‘Getting Even’ With Those Who Didn’t Support Him",
      "National Security Advisor Mike Waltz to Exit Trump Administration After Signal Group Chat Snafu",
      "Ex-Politico Reporter Ryan Lizza Rips Former Outlet for ‘Censorship Campaign’ Against His Substack",
      "Jimmy Kimmel Says Thanks to Trump ‘We’re Already Going to Loan Sharks for Lunchables’ | Video",
      "What to Watch",
      "The Best New Movies Streaming in November 2024",
      "The 40 Best Movies on Netflix Right Now",
      "The 31 Best Movies on Max Right Now",
      "‘The Handmaid’s Tale’ Cast Answers Who June Loves More: Luke or Nick"
    ]
  },
  {
    "url": "https://www.nytimes.com",
    "headlines": [
      "Sections",
      "Top Stories",
      "Newsletters",
      "Podcasts",
      "Sections",
      "Top Stories",
      "Newsletters",
      "Sections",
      "Top Stories",
      "Newsletters",
      "Podcasts",
      "Sections",
      "Recommendations",
      "Newsletters",
      "Podcasts",
      "Sections",
      "Columns",
      "Newsletters",
      "Podcasts",
      "Sections",
      "Topics",
      "Columnists",
      "Podcasts",
      "Listen",
      "Featured",
      "Newsletters",
      "Community",
      "Newsletters",
      "Cooking",
      "Recipes",
      "Editors' Picks",
      "Newsletters",
      "Wirecutter",
      "Reviews",
      "The Best...",
      "Newsletters",
      "The Athletic",
      "Leagues",
      "Top Stories",
      "Newsletters",
      "Sections",
      "Top Stories",
      "Newsletters",
      "Podcasts",
      "Sections",
      "Top Stories",
      "Newsletters",
      "Sections",
      "Top Stories",
      "Newsletters",
      "Podcasts",
      "Sections",
      "Recommendations",
      "Newsletters",
      "Podcasts",
      "Sections",
      "Columns",
      "Newsletters",
      "Podcasts",
      "Sections",
      "Topics",
      "Columnists",
      "Podcasts",
      "Listen",
      "Featured",
      "Newsletters",
      "Community",
      "Newsletters",
      "Cooking",
      "Recipes",
      "Editors' Picks",
      "Newsletters",
      "Wirecutter",
      "Reviews",
      "The Best...",
      "Newsletters",
      "The Athletic",
      "Leagues",
      "Top Stories",
      "Newsletters",
      "New York Times - Top Stories",
      "The Poetry\nChallenge: Day 4",
      "Greet the day with this poem.",
      "More News",
      "The Athletic\n\nSports coverage",
      "Culture and Lifestyle",
      "Audio\n\nPodcasts and narrated articles",
      "Games\n\nDaily puzzles",
      "Site Index",
      "Site Information Navigation"
    ]
  },
  {
    "url": "https://www.reuters.com",
    "headlines": []
  },
  {
    "url": "https://www.reuters.com/world/",
    "headlines": []
  },
  {
    "url": "https://www.reuters.com/business/",
    "headlines": []
  },
  {
    "url": "https://www.reuters.com/legal/",
    "headlines": []
  },
  {
    "url": "https://www.reuters.com/breakingviews/",
    "headlines": []
  },
  {
    "url": "https://www.reuters.com/technology/",
    "headlines": []
  },
  {
    "url": "https://www.reuters.com/investigations/",
    "headlines": []
  },
  {
    "url": "https://www.reuters.com/science/",
    "headlines": []
  },
  {
    "url": "https://www.reuters.com/lifestyle/",
    "headlines": []
  },
  {
    "url": "https://www.wsj.com",
    "headlines": []
  },
  {
    "url": "https://www.wsj.com/tech",
    "headlines": []
  }
]